####################################################################################
#
# Generated by eda_pt_script.tcl	#1
#              eda_pt_generate.tcl	#1
#              in d:/altera/90/quartus/common/tcl/internal/eda_pt/.
#
# Quartus:  Version 9.0 Build 132 02/25/2009 SJ Full Version
#
# Project:  PipelineUniProcessor
# Revision: PipelineUniProcessor
# Device:   EP3SL340F1760I4
#
# Date: Wed Nov 04 6:44:10 PM China Standard Time 2009
#
# Copyright (C) 1991-2009 Altera Corporation
#
####################################################################################


##################
# Header Section #
##################

# This Tcl script should be used for PrimeTime (Verilog) only
set report_default_significant_digits 3
set hierarchy_separator .
set quartus_root "d:/altera/90/quartus/"
set search_path [list . [format "%s%s" $quartus_root "eda/synopsys/primetime/lib"] ]
set link_path [list * stratixiii_atoms.db bb2_lib.db  alt_vtl.db]
read_verilog stratixiii_all_pt.v


########################
# Design Entry Section #
########################

read_verilog pipelineuniprocessor.vo
current_design InstMem
link
set_operating_conditions -analysis_type on_chip_variation
## Use "slow" for slow corner or "fast" for fast corner
set corner slow
if [string equal -nocase $corner slow] {
	read_sdf -analysis_type on_chip_variation pipelineuniprocessor_v.sdo
} elseif [string equal -nocase $corner fast] {
	read_sdf -analysis_type on_chip_variation pipelineuniprocessor_v_fast.sdo
}
## To remove clock reconvergence pessimism, uncomment the following line:
## set timing_remove_clock_reconvergence_pessimism true


######################
# Timing Constraints #
######################

source PipelineUniProcessor.collections.sdc
source PipelineUniProcessor.constraints.sdc

########################
# Output Pins Loadings #
########################

# Pin MEMINST[0] ( Location = AL17 )
set_load -pin_load 0 [get_ports { {MEMINST[0]} } ]
# Pin MEMINST[10] ( Location = P13 )
set_load -pin_load 0 [get_ports { {MEMINST[10]} } ]
# Pin MEMINST[11] ( Location = C22 )
set_load -pin_load 0 [get_ports { {MEMINST[11]} } ]
# Pin MEMINST[12] ( Location = G2 )
set_load -pin_load 0 [get_ports { {MEMINST[12]} } ]
# Pin MEMINST[13] ( Location = E42 )
set_load -pin_load 0 [get_ports { {MEMINST[13]} } ]
# Pin MEMINST[14] ( Location = F42 )
set_load -pin_load 0 [get_ports { {MEMINST[14]} } ]
# Pin MEMINST[15] ( Location = K35 )
set_load -pin_load 0 [get_ports { {MEMINST[15]} } ]
# Pin MEMINST[16] ( Location = BB22 )
set_load -pin_load 0 [get_ports { {MEMINST[16]} } ]
# Pin MEMINST[17] ( Location = M9 )
set_load -pin_load 0 [get_ports { {MEMINST[17]} } ]
# Pin MEMINST[18] ( Location = BA21 )
set_load -pin_load 0 [get_ports { {MEMINST[18]} } ]
# Pin MEMINST[19] ( Location = F1 )
set_load -pin_load 0 [get_ports { {MEMINST[19]} } ]
# Pin MEMINST[1] ( Location = A22 )
set_load -pin_load 0 [get_ports { {MEMINST[1]} } ]
# Pin MEMINST[20] ( Location = F40 )
set_load -pin_load 0 [get_ports { {MEMINST[20]} } ]
# Pin MEMINST[21] ( Location = B22 )
set_load -pin_load 0 [get_ports { {MEMINST[21]} } ]
# Pin MEMINST[22] ( Location = D22 )
set_load -pin_load 0 [get_ports { {MEMINST[22]} } ]
# Pin MEMINST[23] ( Location = E1 )
set_load -pin_load 0 [get_ports { {MEMINST[23]} } ]
# Pin MEMINST[24] ( Location = N11 )
set_load -pin_load 0 [get_ports { {MEMINST[24]} } ]
# Pin MEMINST[25] ( Location = BA22 )
set_load -pin_load 0 [get_ports { {MEMINST[25]} } ]
# Pin MEMINST[26] ( Location = AY22 )
set_load -pin_load 0 [get_ports { {MEMINST[26]} } ]
# Pin MEMINST[27] ( Location = N31 )
set_load -pin_load 0 [get_ports { {MEMINST[27]} } ]
# Pin MEMINST[28] ( Location = M8 )
set_load -pin_load 0 [get_ports { {MEMINST[28]} } ]
# Pin MEMINST[29] ( Location = A21 )
set_load -pin_load 0 [get_ports { {MEMINST[29]} } ]
# Pin MEMINST[2] ( Location = AR21 )
set_load -pin_load 0 [get_ports { {MEMINST[2]} } ]
# Pin MEMINST[30] ( Location = N10 )
set_load -pin_load 0 [get_ports { {MEMINST[30]} } ]
# Pin MEMINST[31] ( Location = D21 )
set_load -pin_load 0 [get_ports { {MEMINST[31]} } ]
# Pin MEMINST[3] ( Location = AV22 )
set_load -pin_load 0 [get_ports { {MEMINST[3]} } ]
# Pin MEMINST[4] ( Location = L6 )
set_load -pin_load 0 [get_ports { {MEMINST[4]} } ]
# Pin MEMINST[5] ( Location = J39 )
set_load -pin_load 0 [get_ports { {MEMINST[5]} } ]
# Pin MEMINST[6] ( Location = F21 )
set_load -pin_load 0 [get_ports { {MEMINST[6]} } ]
# Pin MEMINST[7] ( Location = M20 )
set_load -pin_load 0 [get_ports { {MEMINST[7]} } ]
# Pin MEMINST[8] ( Location = B21 )
set_load -pin_load 0 [get_ports { {MEMINST[8]} } ]
# Pin MEMINST[9] ( Location = AD8 )
set_load -pin_load 0 [get_ports { {MEMINST[9]} } ]
