####################################################################################
#
# Generated by eda_pt_script.tcl	#1
#              eda_pt_generate.tcl	#1
#              in d:/altera/90/quartus/common/tcl/internal/eda_pt/.
#
# Quartus:  Version 9.0 Build 132 02/25/2009 SJ Full Version
#
# Project:  PipelineUniProcessor
# Revision: PipelineUniProcessor
# Device:   AUTO
#
# Date: Mon Nov 23 4:08:37 PM China Standard Time 2009
#
# Copyright (C) 1991-2009 Altera Corporation
#
####################################################################################


##################
# Header Section #
##################

# This Tcl script should be used for PrimeTime (Verilog) only
set report_default_significant_digits 3
set hierarchy_separator .
set quartus_root "d:/altera/90/quartus/"
set search_path [list . [format "%s%s" $quartus_root "eda/synopsys/primetime/lib"] ]
set link_path [list * stratixiii_atoms.db bb2_lib.db  alt_vtl.db]
read_verilog stratixiii_all_pt.v


########################
# Design Entry Section #
########################

read_verilog pipelineuniprocessor.vo
current_design InstMem
link
set_operating_conditions -analysis_type on_chip_variation
## Use "slow" for slow corner or "fast" for fast corner
set corner slow
if [string equal -nocase $corner slow] {
	read_sdf -analysis_type on_chip_variation pipelineuniprocessor_v.sdo
} elseif [string equal -nocase $corner fast] {
	read_sdf -analysis_type on_chip_variation pipelineuniprocessor_v_fast.sdo
}
## To remove clock reconvergence pessimism, uncomment the following line:
## set timing_remove_clock_reconvergence_pessimism true


######################
# Timing Constraints #
######################

source PipelineUniProcessor.collections.sdc
source PipelineUniProcessor.constraints.sdc

########################
# Output Pins Loadings #
########################

# Pin MEMINST2[0] ( Location = N3 )
set_load -pin_load 0 [get_ports { {MEMINST2[0]} } ]
# Pin MEMINST2[10] ( Location = N4 )
set_load -pin_load 0 [get_ports { {MEMINST2[10]} } ]
# Pin MEMINST2[11] ( Location = M6 )
set_load -pin_load 0 [get_ports { {MEMINST2[11]} } ]
# Pin MEMINST2[12] ( Location = R3 )
set_load -pin_load 0 [get_ports { {MEMINST2[12]} } ]
# Pin MEMINST2[13] ( Location = N5 )
set_load -pin_load 0 [get_ports { {MEMINST2[13]} } ]
# Pin MEMINST2[14] ( Location = P2 )
set_load -pin_load 0 [get_ports { {MEMINST2[14]} } ]
# Pin MEMINST2[15] ( Location = K7 )
set_load -pin_load 0 [get_ports { {MEMINST2[15]} } ]
# Pin MEMINST2[16] ( Location = L4 )
set_load -pin_load 0 [get_ports { {MEMINST2[16]} } ]
# Pin MEMINST2[17] ( Location = K2 )
set_load -pin_load 0 [get_ports { {MEMINST2[17]} } ]
# Pin MEMINST2[18] ( Location = R4 )
set_load -pin_load 0 [get_ports { {MEMINST2[18]} } ]
# Pin MEMINST2[19] ( Location = P6 )
set_load -pin_load 0 [get_ports { {MEMINST2[19]} } ]
# Pin MEMINST2[1] ( Location = K3 )
set_load -pin_load 0 [get_ports { {MEMINST2[1]} } ]
# Pin MEMINST2[20] ( Location = P4 )
set_load -pin_load 0 [get_ports { {MEMINST2[20]} } ]
# Pin MEMINST2[21] ( Location = T2 )
set_load -pin_load 0 [get_ports { {MEMINST2[21]} } ]
# Pin MEMINST2[22] ( Location = J1 )
set_load -pin_load 0 [get_ports { {MEMINST2[22]} } ]
# Pin MEMINST2[23] ( Location = K1 )
set_load -pin_load 0 [get_ports { {MEMINST2[23]} } ]
# Pin MEMINST2[24] ( Location = K8 )
set_load -pin_load 0 [get_ports { {MEMINST2[24]} } ]
# Pin MEMINST2[25] ( Location = U2 )
set_load -pin_load 0 [get_ports { {MEMINST2[25]} } ]
# Pin MEMINST2[26] ( Location = L3 )
set_load -pin_load 0 [get_ports { {MEMINST2[26]} } ]
# Pin MEMINST2[27] ( Location = H1 )
set_load -pin_load 0 [get_ports { {MEMINST2[27]} } ]
# Pin MEMINST2[28] ( Location = N6 )
set_load -pin_load 0 [get_ports { {MEMINST2[28]} } ]
# Pin MEMINST2[29] ( Location = R6 )
set_load -pin_load 0 [get_ports { {MEMINST2[29]} } ]
# Pin MEMINST2[2] ( Location = T1 )
set_load -pin_load 0 [get_ports { {MEMINST2[2]} } ]
# Pin MEMINST2[30] ( Location = U3 )
set_load -pin_load 0 [get_ports { {MEMINST2[30]} } ]
# Pin MEMINST2[31] ( Location = P3 )
set_load -pin_load 0 [get_ports { {MEMINST2[31]} } ]
# Pin MEMINST2[3] ( Location = N2 )
set_load -pin_load 0 [get_ports { {MEMINST2[3]} } ]
# Pin MEMINST2[4] ( Location = M3 )
set_load -pin_load 0 [get_ports { {MEMINST2[4]} } ]
# Pin MEMINST2[5] ( Location = U1 )
set_load -pin_load 0 [get_ports { {MEMINST2[5]} } ]
# Pin MEMINST2[6] ( Location = P1 )
set_load -pin_load 0 [get_ports { {MEMINST2[6]} } ]
# Pin MEMINST2[7] ( Location = M7 )
set_load -pin_load 0 [get_ports { {MEMINST2[7]} } ]
# Pin MEMINST2[8] ( Location = H7 )
set_load -pin_load 0 [get_ports { {MEMINST2[8]} } ]
# Pin MEMINST2[9] ( Location = M4 )
set_load -pin_load 0 [get_ports { {MEMINST2[9]} } ]
# Pin MEMINST[0] ( Location = N16 )
set_load -pin_load 0 [get_ports { {MEMINST[0]} } ]
# Pin MEMINST[10] ( Location = N22 )
set_load -pin_load 0 [get_ports { {MEMINST[10]} } ]
# Pin MEMINST[11] ( Location = N21 )
set_load -pin_load 0 [get_ports { {MEMINST[11]} } ]
# Pin MEMINST[12] ( Location = L19 )
set_load -pin_load 0 [get_ports { {MEMINST[12]} } ]
# Pin MEMINST[13] ( Location = T15 )
set_load -pin_load 0 [get_ports { {MEMINST[13]} } ]
# Pin MEMINST[14] ( Location = R22 )
set_load -pin_load 0 [get_ports { {MEMINST[14]} } ]
# Pin MEMINST[15] ( Location = J22 )
set_load -pin_load 0 [get_ports { {MEMINST[15]} } ]
# Pin MEMINST[16] ( Location = V21 )
set_load -pin_load 0 [get_ports { {MEMINST[16]} } ]
# Pin MEMINST[17] ( Location = T20 )
set_load -pin_load 0 [get_ports { {MEMINST[17]} } ]
# Pin MEMINST[18] ( Location = K21 )
set_load -pin_load 0 [get_ports { {MEMINST[18]} } ]
# Pin MEMINST[19] ( Location = M16 )
set_load -pin_load 0 [get_ports { {MEMINST[19]} } ]
# Pin MEMINST[1] ( Location = P17 )
set_load -pin_load 0 [get_ports { {MEMINST[1]} } ]
# Pin MEMINST[20] ( Location = U15 )
set_load -pin_load 0 [get_ports { {MEMINST[20]} } ]
# Pin MEMINST[21] ( Location = T21 )
set_load -pin_load 0 [get_ports { {MEMINST[21]} } ]
# Pin MEMINST[22] ( Location = N20 )
set_load -pin_load 0 [get_ports { {MEMINST[22]} } ]
# Pin MEMINST[23] ( Location = P16 )
set_load -pin_load 0 [get_ports { {MEMINST[23]} } ]
# Pin MEMINST[24] ( Location = R19 )
set_load -pin_load 0 [get_ports { {MEMINST[24]} } ]
# Pin MEMINST[25] ( Location = N17 )
set_load -pin_load 0 [get_ports { {MEMINST[25]} } ]
# Pin MEMINST[26] ( Location = M21 )
set_load -pin_load 0 [get_ports { {MEMINST[26]} } ]
# Pin MEMINST[27] ( Location = M22 )
set_load -pin_load 0 [get_ports { {MEMINST[27]} } ]
# Pin MEMINST[28] ( Location = P20 )
set_load -pin_load 0 [get_ports { {MEMINST[28]} } ]
# Pin MEMINST[29] ( Location = T19 )
set_load -pin_load 0 [get_ports { {MEMINST[29]} } ]
# Pin MEMINST[2] ( Location = P19 )
set_load -pin_load 0 [get_ports { {MEMINST[2]} } ]
# Pin MEMINST[30] ( Location = T22 )
set_load -pin_load 0 [get_ports { {MEMINST[30]} } ]
# Pin MEMINST[31] ( Location = Y22 )
set_load -pin_load 0 [get_ports { {MEMINST[31]} } ]
# Pin MEMINST[3] ( Location = R21 )
set_load -pin_load 0 [get_ports { {MEMINST[3]} } ]
# Pin MEMINST[4] ( Location = V22 )
set_load -pin_load 0 [get_ports { {MEMINST[4]} } ]
# Pin MEMINST[5] ( Location = U22 )
set_load -pin_load 0 [get_ports { {MEMINST[5]} } ]
# Pin MEMINST[6] ( Location = R18 )
set_load -pin_load 0 [get_ports { {MEMINST[6]} } ]
# Pin MEMINST[7] ( Location = R20 )
set_load -pin_load 0 [get_ports { {MEMINST[7]} } ]
# Pin MEMINST[8] ( Location = N19 )
set_load -pin_load 0 [get_ports { {MEMINST[8]} } ]
# Pin MEMINST[9] ( Location = M15 )
set_load -pin_load 0 [get_ports { {MEMINST[9]} } ]
